// ДОДАТКОВЕ

// ДОДАТКОВЕ 1
// Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив,
//     в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// let howMany = Object.keys(friends).length;
// if(howMany >= 3){
//     console.log('Це великий масив,в якому  3 і більше елементи')
// }
// else if(howMany < 3){
//     console.log('Це маленький масив, в якому менше 3-х елементів')
// }
//


// ДОДАТКОВЕ 2
// Маємо 3 числа і між ними  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між
// двома іншими.
//

// let a = +prompt('Enter your number', '1,2,3,4....')
// let b = +prompt('Enter your number', '1,2,3,4....')
// let c = +prompt('Enter your number', '1,2,3,4....')
//
//     if((a > b) && (b < c) ){
//         let result = b;
//         console.log(result);
//     } else if((b > a) && (a < c) ) {
//         result = a;
//         console.log(result);
//     } else if((a > c) && (c < b) ){
//     result = c;
//     console.log(result);
// }


// ДОДАТКОВЕ 3

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

// let a = +prompt('Enter your number','1,2,3,4....');
// let b = +prompt('Enter your number','1,2,3,4....');
// let result = ((a+b)<4) ? console.log('Мало') : console.log('Багато');


// ДОДАТКОВЕ 4
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// /

// let number = +prompt('Введіть будьласка число від 100 до - 100');

// ----------------------------------------------------------------
// if ((number <= -101) && (number >= 101)){
//     console.log('Sorry, try again!!!')
} Я ХОЧУ СЮДА ДОБАВИТЬ ДОП ПРОВЕРКУ ЧТОБ ТИПО  ЕСЛИ ВВЕДУТЬ БОЛЬШЕ 100 и больше -100 чтоб возвращало в промт
или чтото писало. неважно. промудохался час и не смог... здаюсь...
// ----------------------------------------------------------------
// if (Math.sign(number) < 1) {
//     console.log('-');
// } if (Math.sign(number) == 1){
//     console.log('+');
// } if (Math.sign(number) == 0) {
//     console.log('NULL');
// }